app/controllers/books_controller.rb

    def index
      @lastest_add_books = Book.all.order(created_at: :desc )
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

    def search
      search_name = "%#{params[:name]}%"
      @books = Book.where "name like ?", search_name
---
SELECT "books".* FROM "books" WHERE (name like '%guia%')

    def create
      @book = Book.new book_params
      if @book.save
---
INSERT INTO "books" ("name", "author", "publisher", "stars", "about", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "asd"], ["author", "asd"], ["publisher", "asd"], ["stars", 5], ["about", "asd"], ["created_at", "2018-02-04 01:33:09.460336"], ["updated_at", "2018-02-04 01:33:09.460336"]]

    def update
      if @book.update book_params
---
UPDATE "books" SET "about" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["about", "Qual a resposta pra vida, o universo e tudo mais? Hein?"], ["updated_at", "2018-02-04 01:32:55.412556"], ["id", 1]]

    def destroy
      if @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]

    def set_book
      id = params[:id]
      @book = Book.find(id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]