app/controllers/livros_controller.rb

SELECT "livros".* FROM "livros" ORDER BY "livros"."created_at" DESC
---
  def index
    @ultimos_livros_inseridos = Livro.all.order(created_at: :desc )

SELECT  "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    @livro = Livro.find(params[:id])

SELECT "livros".* FROM "livros" WHERE (nome like '%guia%')
---
  def busca
    nome_a_buscar = "%#{params[:nome]}%"
    @livros = Livro.where "nome like ?", nome_a_buscar

INSERT INTO "livros" ("nome", "autor", "editora", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "As crônicas do gelo e fogo"], ["autor", ""], ["editora", ""], ["descricao", ""], ["created_at", "2018-01-30 19:50:54.852787"], ["updated_at", "2018-01-30 19:50:54.852787"]]
---
  def create
    @livro = Livro.new livro_params
    if @livro.save

UPDATE "livros" SET "descricao" = ?, "updated_at" = ? WHERE "livros"."id" = ?  [["descricao", "O livro do dragão, bundas, rola, cara morre e renasce, anão, criança assassina, morte pra porra, putaria e os carai."], ["updated_at", "2018-02-01 20:28:52.611214"], ["id", 20]]
---
  def update
    if @livro.update livro_params

DELETE FROM "livros" WHERE "livros"."id" = ?  [["id", 5]]
---
  def destroy
    if @livro.destroy

SELECT  "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_livro
    id = params[:id]
    @livro = Livro.find(id)